Eppeltone-Engineers-Pvt-Ltd/Three-Phase-Base-MVVNL_Base-Code_010324_FOR_GUJRAT_UNI_47/Application/rl78i1c/application/dlms/meter_app/r_dlms_user_interface.c
// File Name    : r_dlms_user_interface.c
#include <stdio.h>

// Drivers  
#include "r_cg_macrodriver.h"			// Macro Driver Definitions  
#include "r_cg_rtc.h"					// RTC Driver  
#include "r_cg_wdt.h"					// CG WDT Driver  

// DLMS  
#include "r_dlms_typedef.h"				// DLMS Type Definitions  
#include "r_dlms_data.h"				// DLMS Data Definitions  
#include "r_dlms_obis.h"				// DLMS OBIS Definitions  
#include "r_dlms_obis_ic.h"				// DLMS OBIS IC Definitions  
#include "DLMS_User.h"					// DLMS User Definitions  
#include "r_dlms_user_interface.h"		// DLMS User Interface Definitions  
#include "r_dlms_data_meter.h"

#include "emeter3_structs.h"
#include "emeter3_app.h"
#include "tampers.h"
#include "survey.h"
#include "e2rom.h"
#include "utilities.h"
#include "memoryOps.h"


// Standard Lib  
#include <string.h>						// String Standard Lib  

// EM Core Component  
#include "format.h"			// EEPROM Format  
//#include "event_DLMS.h"		// Event Header File  
#include "em_core.h"

//Macro definitions

//Typedef definitions

//Imported global variables and functions (from other files)

void do_initial_things(void);
void readRTC(void);




// Class ID = 07 - Profile generic class  
#if (defined(USED_CLASS_07) && USED_CLASS_07 == 1)
extern Unsigned8					g_Class07_Obj0_Capture_Enable;
extern Unsigned32				g_Class07_Blockload_CapturePeriod;
extern Unsigned32					g_Class07_Blockload_EntriesInUse;
extern Unsigned16					g_Class07_Blockload_CurrentEntry;
extern const Unsigned32					g_Class07_Blockload_MaxEntries;
//extern class07_blockload_entry_t	g_Class07_BlockLoadBuffer[];

extern const Unsigned32				g_Class07_Dailyload_CapturePeriod;
extern Unsigned32					g_Class07_Dailyload_EntriesInUse;
extern Unsigned16					g_Class07_Dailyload_CurrentEntry;
extern const Unsigned32					g_Class07_Dailyload_MaxEntries;
//extern class07_dailyload_entry_t	g_Class07_DailyLoadBuffer[];

extern Unsigned32					g_Class07_Billing_EntriesInUse;
extern Unsigned16					g_Class07_Billing_CurrentEntry;
extern const Unsigned32					g_Class07_Billing_MaxEntries;
//extern class07_billing_entry_t	g_Class07_BillingBuffer[];

extern Unsigned32					g_Class07_Event_EntriesInUse[];
extern Unsigned16					g_Class07_Event_CurrentEntry[];
extern Unsigned32					g_Class07_Event_MaxEntries[];
//extern class07_event_entry_t		g_Class07_EventBuffer[CLASS07_EVENT_MAX_PROFILE][CLASS07_EVENT_MAX_ENTRY];
//extern STORAGE_EEPROM_HEADER 		g_storage_header;								// Storage Header  
#endif

//USER VARIABLE
/*
unsigned int avg_pf;
unsigned long int kwmd_date;//,kvamd_date;
unsigned long int kvamd_date;
date_time_t tmp_time_string;
unsigned int kwmd_val,kvamd_val;
unsigned  int kwmd_time;
unsigned long int kvamd_time;
unsigned long int demand_volt;
unsigned char billing_day;
unsigned int event_cnt[TOT_EVENT_TYPE];
extern class07_billing_entry_t g_Class07_BillingBuffer;
*/

extern Unsigned8 secret1[9];//="ABCDEFGH";
extern Unsigned8 secret2[17];//="RENESAS_P6wRJ21F";
/*
//unsigned long int meter_no;
void convert_data_string(unsigned long int tmp_long, unsigned char size);	// not needed - 25/Jul/2020
unsigned char string1[8];	// not needed - 25/Jul/2020
//Exported global variables and functions (to be accessed by other files)
*/
//Private global variables and functions
/*
void convert_data_string(unsigned long int tmp_long, unsigned char size)
{
	unsigned char i;
	
	for(i=0;i<size;i++)
	{
		string1[size-i-2]=tmp_long%10+0x30;
		tmp_long=tmp_long/10;
	}
}
*/

// RL78/G13 Day Of Week Driver  
const Unsigned8 g_DayOfWeek[7] =
{	
	DATE_WEEK_SUN,		// 0 is Sunday  
	DATE_WEEK_MON,		// 1 is Monday  
	DATE_WEEK_TUE,		// 2 is Tuesday  
	DATE_WEEK_WED,		// 3 is Wednesday  
	DATE_WEEK_THU,		// 4 is Thusday  
	DATE_WEEK_FRI,		// 5 is Friday  
	DATE_WEEK_SAT,		// 6 is Saturday  
	
};

void R_USER_Set_RTC_timezone(void)
{
	//g_Class08_RTC_TimeZone
	
	
}

void R_USER_Convert2date_time(date_time_t *p_date_time, RTC_DATE_TIME *p_rtctime)
{
}

void R_USER_GetRTCTime(date_time_t *p_date_time)
{
	uint8_t  status;	// Status of operation  
	uint16_t timeout;		
	rtc_calendarcounter_value_t rtctime; // RTC value for Driver IF  

	// Check parameters
	if (p_date_time == NULL)
		return;

	timeout = 100;
	R_RTC_Get_CalendarCounterValue(&rtctime);
	status = MD_OK;

	if (status != MD_OK)
		return;

	// Convert all to decimal
	_BCD2DEC(rtctime.rseccnt);
	_BCD2DEC(rtctime.rmincnt);
	_BCD2DEC(rtctime.rhrcnt);
	_BCD2DEC(rtctime.rdaycnt);
	_BCD2DEC(rtctime.rwkcnt);
	_BCD2DEC(rtctime.rmoncnt);
	_BCD2DEC(rtctime.ryrcnt);

	// Convert to date_time_t structure
	// HIGH of Year
	timeout = 2000 + rtctime.ryrcnt;
	p_date_time->year_high         = (Unsigned8)(timeout >> 8);
	// LOW  of Year
	p_date_time->year_low          = (Unsigned8)timeout;
	p_date_time->month             = (Unsigned8)rtctime.rmoncnt;					// Month
	p_date_time->day_of_month      = (Unsigned8)rtctime.rdaycnt;					// Day
	p_date_time->day_of_week       = (Unsigned8)g_DayOfWeek[rtctime.rwkcnt];		// Friday
	p_date_time->hour              = (Unsigned8)rtctime.rhrcnt;					// Hour
	p_date_time->minute            = (Unsigned8)rtctime.rmincnt;					// Minute
	p_date_time->second            = (Unsigned8)rtctime.rseccnt;					// Second
	// Not support
	p_date_time->hundredths        = (Unsigned8)TIME_HUNDREDTHS_NOT_SPECIFIED;
	// Time zone in min 
	p_date_time->deviation_high    = 0x80;//(Unsigned8)(((Unsigned16)7 * 60) >> 8);
 	p_date_time->deviation_low     = 0x00;//(Unsigned8)(((Unsigned16)7 * 60));
	// Daylight saving active 
	p_date_time->clock_status      = (Unsigned8)NOT_SPECIFIED;
}

void R_USER_SetRTCTime(date_time_t date_time)
{
	Unsigned8  i;					// Counter  
	Unsigned8  status;				// Status of operation  
	Unsigned16 timeout;				// Timeout counter to ensure the system not crash  
	rtc_calendarcounter_value_t rtctime;		// RTC value for Driver IF  
	date_time_t original_date_time;
	Unsigned8  *p_u8;

	// Get original date_time first  
	R_USER_GetRTCTime(&original_date_time);

	// Checking the correction before setting or keep as original  
	if (date_time.year_high != 0xFF && date_time.year_low != 0xFF)
	{
		original_date_time.year_high = date_time.year_high;
		original_date_time.year_low = date_time.year_low;
	}
	if (date_time.month < 13 && date_time.month > 0)
	{
		original_date_time.month = date_time.month;
	}
	if (date_time.day_of_month < 32 && date_time.day_of_month > 0)
	{
		original_date_time.day_of_month = date_time.day_of_month;
	}
	if (date_time.hour < 24)
	{
		original_date_time.hour = date_time.hour;
	}
	if (date_time.minute < 60)
	{
		original_date_time.minute = date_time.minute;
	}
	if (date_time.second < 60)
	{
		original_date_time.second = date_time.second;
	}
	if(date_time.deviation_high != 0x80 && date_time.deviation_low != 0x00) // 0x8000 = not specified
	{
		original_date_time.deviation_high = date_time.deviation_high;
		original_date_time.deviation_low = date_time.deviation_low;
	}

	// Recalculate year  
	timeout         = ((Unsigned16)original_date_time.year_high << 8);
	timeout        += (Unsigned16)original_date_time.year_low;

	// Recalculate day of week  
	original_date_time.day_of_week = 0xFF;// (Unsigned8)R_OBIS_wday((Integer16)timeout, (Integer16)original_date_time.month, (Integer16)original_date_time.day_of_month);

	// Get the RTC value from date_time  
	rtctime.rdaycnt   = date_time.day_of_month;
	rtctime.rmoncnt   = date_time.month;
	rtctime.ryrcnt    = (Unsigned8)((timeout % 100));
	rtctime.rhrcnt    = date_time.hour;
	rtctime.rmincnt   = date_time.minute;
	rtctime.rseccnt   = date_time.second;
	for (i = 0; i < 7; i++)
	{
		if (g_DayOfWeek[i] == original_date_time.day_of_week)
		{
			break;
		}
	}
	if (i == 7)
	{
		i = 0;
	}
	rtctime.rwkcnt    = i;

	// Convert to BCD  
	_DEC2BCD(rtctime.rdaycnt);
	_DEC2BCD(rtctime.rmoncnt);
	_DEC2BCD(rtctime.ryrcnt);
	_DEC2BCD(rtctime.rhrcnt);
	_DEC2BCD(rtctime.rmincnt);
	_DEC2BCD(rtctime.rseccnt);
	_DEC2BCD(rtctime.rwkcnt);

	// Set to by RTC driver IF  
	timeout = 100;
	R_RTC_Set_CalendarCounterValue(rtctime);
	status = MD_OK;
	
	readRTC();	// this is to get the values in our data structure

 
	do_initial_things();
	
