Eppeltone-Engineers-Pvt-Ltd/Three-Phase-Base-MVVNL_Base-Code_010324_FOR_GUJRAT_UNI_47/Application/rl78i1c/application/dlms/meter_app/r_dlms_user_interface.c
	Common_Data.pgm_count++;
	e2write_flags|=E2_W_IMPDATA;

	
// what do the following three lines do?	
//	//p_u8 = (Unsigned8 *)&330;
//	*(p_u8 + 1) = 0x80;//original_date_time.deviation_high;
//	*(p_u8) = 0x00;//original_date_time.deviation_low;
}

Unsigned8 R_USER_GetSpecificTime(Unsigned16 time_id, date_time_t *p_date_time)
{
	Unsigned8 result = 1;
	Unsigned8 support_log_class7 = 0;

	switch(time_id)
	{
		case CURRENT_TIME:
			R_USER_GetRTCTime(p_date_time);
			result = 0;
			break;
			
		case LASTBILLING_TIME:
			{
				if (support_log_class7 == 1)
				{
//					memcpy((Unsigned8 *)p_date_time,(Unsigned8 *)&energy_log.bill_date, 12);
				}
			}
			result = 0;
			break;
		case LAST_ACTIVE_MD_TIME:
			{
				if (support_log_class7 == 1)
				{
					//memcpy((Unsigned8 *)p_date_time,(Unsigned8 *)&energy_log.active_MD_time, 12); // NEED TO IMPLEMENT
				}
			}
			result = 0;
			break;
		case LAST_APPARENT_MD_TIME:
			{
				if (support_log_class7 == 1)
				{
					//memcpy((Unsigned8 *)p_date_time,(Unsigned8 *)&energy_log.apparent_MD_time, 12); // NEED TO IMPLEMENT
				}
			}
			result = 0;
			break;
		// And more …  
		default:
			return 1;
	}

	return result;
}

Unsigned8 R_USER_SetSpecificTime(Unsigned16 time_id, date_time_t date_time)
{
	Unsigned8 result = 1;

	switch(time_id)
	{
		case CURRENT_TIME:
			R_USER_SetRTCTime(date_time);
			result = 0;
			break;
		case LASTBILLING_TIME:
		case LAST_ACTIVE_MD_TIME:
		case LAST_APPARENT_MD_TIME:
			result = 1; // Not allow to change
			break;
		// And more …  
		default:
			return 1;
	}

	return result;
}

void R_USER_WDT_Restart(void)
{
	R_WDT_Restart();
}

const unsigned char manfact_name[30]="Eppeltone Engineers Pvt Ltd\0";
//const unsigned char manfact_name[40]="United Electrical Industries Limited\0";

const unsigned char ldn_name[16]="EEOEPL\0";
//const unsigned char ldn_name[16]="UEIL\0";

//unsigned char manfact_name[25]="EPPELTONE\0"; // not used
#if defined(METER_CLASS) && (METER_CLASS==5)
const unsigned char meter_rating[10]="5-10 A\0";
#else
const unsigned char meter_rating[10]="10-60 A\0";
#endif


Integer16 R_USER_GetNamePlate(Unsigned16 nameplate_id, Unsigned8* p_data)
{
	Integer16 result_len = -1;
	Unsigned16	u16;
	Unsigned8 firmware_version[]="V1.01\0";

#if (defined(METER_CLASS) && METER_CLASS == 5)
	Unsigned8 category_name[]="C1\0";
#else	
	Unsigned8 category_name[]="C2\0";
#endif

//	Unsigned8 category_name[]="C2\0";

	Unsigned8 tbuf[16];
	
	if(p_data == NULL)
	{
		return -1;
	}

	switch(nameplate_id)
	{
		case NAME_PLATE_LOGICAL_NAME:
			result_len = strlen((void*)ldn_name);
			memcpy((Unsigned8 *)p_data,(Unsigned8 *)ldn_name, result_len);
			break;
		case NAME_PLATE_METER_SERIAL:
//			convert_data_string(Common_Data.meterNumber,8); 				
//			result_len = strlen((void*)string1);
//			memcpy((Unsigned8 *)p_data,(Unsigned8 *)string1, result_len);
			getFullMeterNumber((uint8_t*)&tbuf[0]);
//			sprintf((char*)tbuf,"%ld",Common_Data.meterNumber); 				
			result_len = strlen((char*)tbuf);
			memcpy((Unsigned8 *)p_data, tbuf, result_len);

			break;
		case NAME_PLATE_MANUFACT_NAME:
			result_len = strlen((void*)manfact_name);
			memcpy((Unsigned8 *)p_data,(Unsigned8 *)manfact_name, result_len);
			break;
		case NAME_PLATE_FIRMWARE_NAME:
			result_len = strlen((void*)firmware_version);
			memcpy((Unsigned8 *)p_data,(Unsigned8 *)firmware_version, result_len);
			break;
		case NAME_PLATE_METER_TYPE:
			//ATTR_TYPE_LONG_UNSIGNED
			// (2 bytea) a value of 5 indicates 1P-2W 
#if defined(METER_CLASS) && (METER_CLASS==5)
			*p_data++ = 3;
#else
			*p_data++ = 4;
#endif			
			*p_data++ = 0;
			result_len = 2;
			break;
		case NAME_PLATE_CATEGORY_NAME:
			result_len = strlen((void*)category_name);
			memcpy((Unsigned8 *)p_data,(Unsigned8 *)category_name, result_len);
			break;
		case NAME_PLATE_CURRRATE_NAME:
			result_len = strlen((void*)meter_rating);
			memcpy((Unsigned8 *)p_data,(Unsigned8 *)meter_rating, result_len);
			break;
			
		case NAME_PLATE_YEAR_OF_MANUFACT:
			//ATTR_TYPE_LONG_UNSIGNED
			u16 = 2000 + Common_Data.batchyear;
//			u16 = 2018;
			*p_data++ = (Unsigned8)(u16 &0xFF);
			*p_data++ = (Unsigned8)((u16>>8) &0xFF);
			result_len = 2;
			break;

		case NAME_PLATE_CT_RATIO:
			*p_data++ = 1;
			*p_data++ = 0;
			result_len = 2;
			break;

		case NAME_PLATE_PT_RATIO:
			*p_data++ = 1;
			*p_data++ = 0;
			result_len = 2;
			break;
			
			
		// And more …  
		default:
			return -1;
	}
	
	return result_len;
}

//#define CURRENT_BLOCK_ENERGY	// comment this if previous block energy is required
//#define CURRENT_MONTH_DURATION	// option not available at present



Integer32 R_USER_GetEMData(Unsigned16 em_data)
{
	Integer32 result = 0;
	Integer32 temp = 0;
	uint16_t utemp16=0;

#ifndef CURRENT_BLOCK_ENERGY
	uint32_t addr;
#endif

	switch(em_data)
	{
		case I_R:
			result = (getInstantaneousParams(ICURRENTS,LINE_PHASE_R)*100.0);
			break;
		
		case I_Y:
			result = (getInstantaneousParams(ICURRENTS,LINE_PHASE_Y)*100.0);
			break;
		
		case I_B:
			result = (getInstantaneousParams(ICURRENTS,LINE_PHASE_B)*100.0);
			break;
		
		case V_R:
			result = (getInstantaneousParams(IVOLTS,LINE_PHASE_R)*10.0);
			break;
		
		case V_Y:
			result = (getInstantaneousParams(IVOLTS,LINE_PHASE_Y)*10.0);
			break;
		
		case V_B:
			result = (getInstantaneousParams(IVOLTS,LINE_PHASE_B)*10.0);
			break;

		case PF_R:
			result = (int32_t)(getInstantaneousParams(IPFS,LINE_PHASE_R)*1000.0);
			break;
		
		case PF_Y:
			result = (int32_t)(getInstantaneousParams(IPFS,LINE_PHASE_Y)*1000.0);
			break;
		
		case PF_B:
			result = (int32_t)(getInstantaneousParams(IPFS,LINE_PHASE_B)*1000.0);
			break;

		case PF_TOTAL:	// average pf - instantaneous
				result = (int32_t)(getInstantaneousParams(IPFS,LINE_TOTAL)*1000.0);
			break;

		case APPARENT_POWER:	// kVA
			result = getInstantaneousParams(APP_POWER,LINE_TOTAL);
			break;

		case ACTIVE_POWER:	// KW signed
			result = getInstantaneousParams(ACT_POWER,LINE_TOTAL);
			break;

		case REACTIVE_POWER:	// kVAR - signed +Lag -Lead
			result = getInstantaneousParams(REACT_POWER_SIGNED, LINE_TOTAL);	// power already comes in watts
			break;

