Eppeltone-Engineers-Pvt-Ltd/Three-Phase-Base-MVVNL_Base-Code_010324_FOR_GUJRAT_UNI_47/Application/rl78i1c/application/dlms/meter_app/r_dlms_user_interface.c
		case CUM_ACTIVE_ENERGY:	// KWH
//			result = myenergydata.kwh;
			result = total_energy_lastSaved;
			break;

		case CUM_REACTIVE_LAG_ENERGY:	// Kvarh_lag
//			result = myenergydata.kvarh_lag;
			result = reactive_energy_lag_lastSaved;
			break;

		case CUM_REACTIVE_LEAD_ENERGY:	// Kvarh_lead
//			result = myenergydata.kvarh_lead;
			result = reactive_energy_lead_lastSaved;
			break;

		case CUM_APPARENT_ENERGY:	// Kvah
//			result = myenergydata.kvah;
			result = apparent_energy_lastSaved;
			break;

		case CUM_POWER_FAILURE_COUNT:	//
			result = (Unsigned32)Common_Data.noOfPowerFailures;
			break;

		case CUM_POWER_FAILURE_DURN:	//
			temp = computePowerOffDurn(rtc);	// use the rtc for current value and returns power fail duration for the month
			temp += Common_Data.cumPowerFailDuration;	// now it is cumulative
			result = temp;

			if(result<0)
				result = 0;
			break;
			
		case CUM_TAMPER_CNT:	//
			result = (Unsigned32)mytmprdata.tamperCount;
			break;
			
		case CUM_BILLING_CNT:	//
			result = (Unsigned32)Common_Data.bpcount;
			break;

		case CUM_PROGAM_CNT:	//
			result = (Unsigned32)Common_Data.pgm_count;
			break;

		case BILLING_DATE:	//
			result = (Unsigned32)Common_Data.billing_date;
			break;
			
		case FREQUENCY:	// frequency
//			result = EM_GetLineFrequency(LINE_TOTAL)*10.0;
			result = getInstantaneousParams(IFREQS, LINE_TOTAL)*10;// this will return 0 in battery mode
			break;
			
		case EM_ACTIVE_MD:			
// now being handled in R_OBIS_DistributeXRegisterClass 		
			result = mymddata.mdkw;
			break;
			
		case EM_APPARENT_MD:
// now being handled in R_OBIS_DistributeXRegisterClass 		
			result = mymddata.mdkva;
			break;
			
		case EM_REACTIVE_MD:	// current mdkvar - this value is not there
			result = 0;
			break;
			
		case I_N:	// neutral current
			result = (getInstantaneousParams(ICURRENTS,LINE_NEUTRAL)*100.0);
			break;

		case DEMAND_INTEGRATION_PERIOD:
			// Exchange from minutes to seconds
//			result = (Common_Data.mdinterval*60);
			result = (Common_Data.new_mdinterval*60);
			break;
			
		case PROFILE_CAPTURE_PERIOD:
			// Exchange from minutes to seconds
			result = (Common_Data.survey_interval*60); //R ENESAS, TO BE MODIFY
			g_Class07_Blockload_CapturePeriod = result;
			break;
			
		case AVL_BILLING_PERIOD:
			result = g_Class07_Billing_EntriesInUse-1;
			break;

		case EM_BLOCK_ENERGY_KWH:
			if(total_energy_lastSaved>ctldata.last_saved_kwh)
		  	result=(total_energy_lastSaved-ctldata.last_saved_kwh);
				
//			result = (int32_t)utemp16;
			break;

		case EM_BLOCK_ENERGY_KVARH_LAG:
		#ifdef SURVEY_USES_REACTIVE_DATA	
			if(reactive_energy_lag_lastSaved>ctldata.last_saved_kvarh_lag)
			  result=(reactive_energy_lag_lastSaved-ctldata.last_saved_kvarh_lag);
			
//			result = (int32_t)utemp16;
		#else
			result = 0;
		#endif	
			break;
			
		case EM_BLOCK_ENERGY_KVARH_LEAD:
		#ifdef SURVEY_USES_REACTIVE_DATA
			if(reactive_energy_lead_lastSaved>ctldata.last_saved_kvarh_lead)
			  result=(reactive_energy_lead_lastSaved-ctldata.last_saved_kvarh_lead);
			
//			result = (int32_t)utemp16;
		#else
			result = 0;
		#endif	
			break;
			
		case EM_BLOCK_ENERGY_KVAH:
			if(apparent_energy_lastSaved>ctldata.last_saved_kvah)
			  result=(apparent_energy_lastSaved-ctldata.last_saved_kvah);
				
//			result = (int32_t)utemp16;
			break;
			
		case POWER_ON_DURATION:
			result = ctldata.powerOnminutes_eb;	// since 12/02/2024
//			result = (int32_t)utemp16;
			break;

#ifdef BIDIR_METER			
		case I_R_AVG:
			result = average_Ir;
			break;
		
		case I_Y_AVG:
			result = average_Iy;
			break;
		
		case I_B_AVG:
			result = average_Ib;
			break;
		
		case V_R_AVG:
			result = average_Vr;
			break;
		
		case V_Y_AVG:
			result = average_Vy;
			break;
		
		case V_B_AVG:
			result = average_Vb;
			break;
			
		case CUM_ACTIVE_ENERGY_EXPORT:	// KWH
//			result = myenergydata.kwh_export;
			result = total_energy_lastSaved_export;
			break;

		case CUM_REACTIVE_LAG_ENERGY_EXPORT:
//			result = myenergydata.kvarh_lag_export;
			result = reactive_energy_lag_lastSaved_export;
			break;

		case CUM_REACTIVE_LEAD_ENERGY_EXPORT:
//			result = myenergydata.kvarh_lead_export;
			result = reactive_energy_lead_lastSaved_export;
			break;

		case CUM_APPARENT_ENERGY_EXPORT:
//			result = myenergydata.kvah_export;
			result = apparent_energy_lastSaved_export;
			break;

		case EM_ACTIVE_MD_EXPORT:		
// now being handled in R_OBIS_DistributeXRegisterClass 		
//			ConvertRTCDate(&g_Class04_mdCaptureTime, &mymddata.mdkw_datetime_export);
			result = mymddata.mdkw_export;
			break;
			
		case EM_APPARENT_MD_EXPORT:
// now being handled in R_OBIS_DistributeXRegisterClass 		
//			ConvertRTCDate(&g_Class04_mdCaptureTime, &mymddata.mdkva_datetime_export);
			result = mymddata.mdkva_export;
			break;
#endif

		default:
			break;
	}

	return result;
}

Integer8 R_USER_SetEMData(Unsigned16 em_data, Unsigned8 *p_em_value)
{
	// Result of response, def. is not Matched  
	Unsigned8 response_result = TYPE_UNMATCH;
	Unsigned16 tmp_long=0;
	date_t * tt;
//	EM_CONFIG 		config;
//	Integer8 result = -1;
//	Unsigned16 data;

	tmp_long= (Unsigned16 *)p_em_value;

	switch(em_data)
	{
		case DEMAND_INTEGRATION_PERIOD: //md interval to be in minutes only
			if((tmp_long==900)||(tmp_long==1800)||(tmp_long==3600))
			{
				Common_Data.new_mdinterval = (tmp_long/60);	// this value will be transferred at next 00 or 30 minutes
				Common_Data.pgm_count++;
				e2write_flags|=E2_W_IMPDATA;
				record_transaction_event(MD_INTERVAL_TRANSACTION_MASK);
				response_result = DATA_ACCESS_RESULT_SUCCESS;
			}
			break;
			
		case PROFILE_CAPTURE_PERIOD: //survey_interval in minutes only
			if((tmp_long==900)||(tmp_long==1800)||(tmp_long==3600))
			{
				Common_Data.new_survey_interval = (tmp_long/60);	// this value will be transferred at next 00 or 30 minutes
				g_Class07_Blockload_CapturePeriod=tmp_long;
				Common_Data.pgm_count++;
				e2write_flags|=E2_W_IMPDATA;
				record_transaction_event(SURVEY_INTERVAL_TRANSACTION_MASK);
				response_result = DATA_ACCESS_RESULT_SUCCESS;
				genflags|=SURVEY_INTERVAL_CHANGED;	// set this flag to indicate that survey interval has been changed
			}
			break;
			
		case BILLING_DATE: //USER CODE
			tt=(date_t *)p_em_value;
			if ((tt->day_of_month>=1)&&(tt->day_of_month<=31))
			{
				Common_Data.billing_date=tt->day_of_month;
				Common_Data.pgm_count++;
				e2write_flags|=E2_W_IMPDATA;
				record_transaction_event(SINGLE_ACTION_TRANSACTION_MASK);
				response_result = DATA_ACCESS_RESULT_SUCCESS;
			}
			break;
			
