Eppeltone-Engineers-Pvt-Ltd/Three-Phase-Base-MVVNL_Base-Code_010324_FOR_GUJRAT_UNI_47/Application/rl78i1c/application/dlms/meter_app/r_dlms_user_interface.c
//		case EM_CUCUMLARIVE_TAMPER_CNT:
//			{
//				//result = (Float32)g_storage_header.num_of_tamper_log; //RENESAS_USER TODO
////				g_storage_header.num_of_tamper_log = *((Unsigned16*)p_em_value);//RENESAS_USER TODO
//			}
//			break;
//		case EM_CUCUMLARIVE_BILLING_CNT:
//			{
////				g_Class07_Billing_EntriesInUse = *((Unsigned16*)p_em_value);//RENESAS_USER TODO
////				g_storage_header.num_of_energy_log = (Unsigned16)g_Class07_Billing_EntriesInUse; //RENESAS_USER TODO
//			}
//			break;
//		case EM_CUCUMLARIVE_PROGAM_CNT:
//			{
//			
////				data = *((Unsigned16*)p_em_value);//RENESAS_USER TODO
////				g_storage_header.program_cnt = data;//RENESAS_USER TODO
//			}
//			break;
		default:
			break;
	}

	return response_result;
}

#if (defined(USED_CLASS_09) && USED_CLASS_09 == 1)
// Class09 - Script table  
Unsigned8 R_USER_Class09_ScriptExecute(Unsigned16 ID)
{
	switch(ID)
	{
		// Option: User code START  
		case SCRIPT_ACTION_TZ1:
		case SCRIPT_ACTION_TZ2:
		case SCRIPT_ACTION_TZ3:
		case SCRIPT_ACTION_TZ4:
			break;
		// Option: User code END  
		default:
			// Do nothing 
			break;
	}
	return 0;
}
#endif // #if (defined(USED_CLASS_09) && USED_CLASS_09 == 1)  

#if (defined(USED_CLASS_15) && USED_CLASS_15 == 1)
// Class15 -  Association LN  
Unsigned8 R_USER_Class15_Secret_Backup(
	Unsigned8             *p_secret,
	Unsigned16            length,
	Unsigned8             mechanism_id
)
{
	// Check params  
	if (p_secret == NULL || length == 0 || mechanism_id == MECHANISM_ID0_LOWEST_SECURITY)
	{
		return 1;
	}
	if (mechanism_id == MECHANISM_ID1_LOW_SECURITY)
	{
		//CLK> Pls do some check to ensure the LLS length is within EEPROM storage expected space
		if (length>8)
		{
			return 1;
		}
		
//		memset(secret1, 0, 9);	// this should make the entire buffer 0s
//		memcpy(secret1, p_secret, length);
		
		write_alternately(SECRET1_ADDRESS,ALTERNATE_SECRET1_ADDRESS,(uint8_t*)&secret1,9);	// the null character is being written into memory
// upon returning from above function secret1[length] has been corrupted
// it should be made NULL
		secret1[length]=0x00;	// secret1 is now again a string
		
		Set_PP(0,15);
		return 0; //Return 0 for OK 
	}
	else // HLS
	{
		//CLK> Pls do some check to ensure the HLS length is within EEPROM storage expected space
		if (length>16)
		{
			return 1;
		}

//		memset(secret1, 0, 17);	// this should make the entire buffer 0s
//		memcpy(secret2, p_secret, length);
		
//		memset(secret2, 0, 17); // is this necessary or writing 17 bytes is sufficient
		write_alternately(SECRET2_ADDRESS,ALTERNATE_SECRET2_ADDRESS,(uint8_t*)&secret2,17);	// the null character is being written into memory
// upon returning from above function secret1[length] has been corrupted
// it should be made NULL
		secret2[length]=0x00;	// secret2 is now again a string

		Set_PP(0,16);
		return 0; //Return 0 for OK 
	}
	
//	return 0;
}

Unsigned8 R_USER_Class15_Secret_Restore(
	Unsigned8             *p_secret,
	Unsigned16            length,
	Unsigned8             mechanism_id
)
{
	// Check params  
	if (p_secret == NULL || length == 0 || mechanism_id == MECHANISM_ID0_LOWEST_SECURITY)
	{
		return 1;
	}
	if (mechanism_id == MECHANISM_ID1_LOW_SECURITY)
	{
		//CLK> Pls do some check to ensure the LLS length is within EEPROM storage expected space
//		if (DLMS_LLS_SECRET_SIZE >= length)
//		{
//			return 1;
//		}
		p_secret =(uint8_t *) secret1;  //CLK> Should read from EEPOM
		return 0; //Return 0 for OK 
//		// Check EEPROM setting  
//		if (DLMS_LLS_SECRET_ADDR == DLMS_ADDR_NOTSPECIFIC || DLMS_LLS_SECRET_SIZE != length)
//		{
//			return 1;
//		}
//		if (E2PR_READ(
//			DLMS_LLS_SECRET_ADDR,
//			(uint8_t *)p_secret,
//			DLMS_LLS_SECRET_SIZE
//			) != E2PR_OK)
//		{
//			return 1;
//		}
	}
	else // HLS
	{
		//CLK> Pls do some check to ensure the HLS length is within EEPROM storage expected space
//		if (DLMS_HLS_SECRET_SIZE != length)
//		{
//			return 1;
//		}

		p_secret =(uint8_t *) secret2; //CLK> Should read from EEPOM
		return 0; //Return 0 for OK 
//		// Check EEPROM setting  
//		if (DLMS_HLS_SECRET_ADDR == DLMS_ADDR_NOTSPECIFIC || DLMS_HLS_SECRET_SIZE != length)
//		{
//			return 1;
//		}
//		if (E2PR_READ(
//			DLMS_HLS_SECRET_ADDR,
//			(uint8_t *)p_secret,
//			DLMS_HLS_SECRET_SIZE
//			) != E2PR_OK)
//		{
//			return 1;
//		}
	}
	
//	return 0;
}
#endif // #if (defined(USED_CLASS_15) && USED_CLASS_15 == 1)  


#if (defined(USED_CLASS_20) && USED_CLASS_20 == 1)
// Class 20 - Activity Calendar  


Unsigned8 R_USER_Class20_GetTariffSeasonTable(
	season_profile_t    *buf,
	Unsigned16          index,
	Unsigned16          is_active
)
{
	// Option: User code START  
	// Follow EM SDK config to update for DLMS info
//	* Now just keep default setting

	// Option: User code END  
	return 0;
}

Unsigned8 R_USER_Class20_GetTariffWeekTable(
	week_profile_t      *buf,
	Unsigned16          index,
	Unsigned16          is_active
)
{
	// Option: User code START  
	// Follow EM SDK config to update for DLMS info
//	* Now just keep default setting

	// Option: User code END  
	return 0;
}

Unsigned8 R_USER_Class20_GetTariffDayTable(
	day_profile_t       *buf,
	Unsigned16          index,
	Unsigned16          is_active
)
{

// fill the buf with entries of 	
//	buf->day_schedule.TZ_start_time0[0]=(time_t)variable which contains the zone settings in e2rom 
	
	
	// Option: User code START  
	// Follow EM SDK config to update for DLMS info
//	* Now just keep default setting

	// Option: User code END  
	return 0;
}

Unsigned8 R_USER_Class20_Activate_PassiveCalendar(class20_child_record_t *p_child_record_20)
{
	// Option: User code START  
	// Callback function  to User who can get this information to update tariff.
	
	// Option: User code END  
	return 0;
}

	#if (defined(USED_CLASS_20_SEASON_PROFILE) && USED_CLASS_20_SEASON_PROFILE == 1)
void R_USER_Class20_ChangSeason(date_time_t current_time)
{
	// Option: User code START  
	// Option: User code END  
	return;
}
	#endif // #if (defined(USED_CLASS_20_SEASON_PROFILE) && USED_CLASS_20_SEASON_PROFILE == 1)
	
	#if (defined(USED_CLASS_20_WEEK_PROFILE) && USED_CLASS_20_WEEK_PROFILE == 1)

void R_USER_Class20_ChangeWeekDay(date_time_t current_time)
{
	// Option: User code START  
	// Option: User code END  
	return;
}
	#endif // #if (defined(USED_CLASS_20_WEEK_PROFILE) && USED_CLASS_20_WEEK_PROFILE == 1)  

Unsigned8 R_USER_Class20_Active_Passive_Time(void)
{	
	//R_OBIS_Class20_Activate_PassiveCalendar();
	Set_PP(0,5);
	return 0;
	
}
#endif // #if (defined(USED_CLASS_20) && USED_CLASS_20 == 1)  
void Set_PP(unsigned int i, unsigned char j)
{
}